{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.3", "config": {"output_layers": [["dense_1", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 50], "dtype": "float32", "name": "input_1", "sparse": false}}, {"name": "input_2", "class_name": "InputLayer", "inbound_nodes": [], "config": {"batch_input_shape": [null, 20], "dtype": "float32", "name": "input_2", "sparse": false}}, {"name": "embedding_1", "class_name": "Embedding", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"input_dim": 9002, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "activity_regularizer": null, "name": "embedding_1", "embeddings_constraint": null, "trainable": true, "output_dim": 100, "input_length": null, "embeddings_regularizer": null, "batch_input_shape": [null, null], "dtype": "float32", "mask_zero": false}}, {"name": "embedding_2", "class_name": "Embedding", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"input_dim": 5001, "embeddings_initializer": {"class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}}, "activity_regularizer": null, "name": "embedding_2", "embeddings_constraint": null, "trainable": true, "output_dim": 100, "input_length": null, "embeddings_regularizer": null, "batch_input_shape": [null, null], "dtype": "float32", "mask_zero": false}}, {"name": "conv1d_1", "class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [10], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_1", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_2", "class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [7], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_2", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_3", "class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_3", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_4", "class_name": "Conv1D", "inbound_nodes": [[["embedding_1", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_4", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_5", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [10], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_5", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_6", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [7], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_6", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_7", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_7", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "conv1d_8", "class_name": "Conv1D", "inbound_nodes": [[["embedding_2", 0, 0, {}]]], "config": {"filters": 256, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3], "activity_regularizer": null, "dilation_rate": [1], "name": "conv1d_8", "kernel_regularizer": null, "strides": [1], "kernel_constraint": null, "bias_constraint": null, "bias_regularizer": null, "padding": "valid", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activation": "tanh", "use_bias": true}}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_1", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_1", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_2", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_2", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_3", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_3", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_4", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_4", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_5", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_5", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_6", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_6", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_7", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_7", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["conv1d_8", 0, 0, {}]]], "config": {"beta_constraint": null, "gamma_constraint": null, "scale": true, "axis": -1, "epsilon": 0.001, "name": "batch_normalization_8", "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}}}, {"name": "global_max_pooling1d_1", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_1"}}, {"name": "global_max_pooling1d_2", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_2"}}, {"name": "global_max_pooling1d_3", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_3"}}, {"name": "global_max_pooling1d_4", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_4"}}, {"name": "global_max_pooling1d_5", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_5", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_5"}}, {"name": "global_max_pooling1d_6", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_6", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_6"}}, {"name": "global_max_pooling1d_7", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_7"}}, {"name": "global_max_pooling1d_8", "class_name": "GlobalMaxPooling1D", "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]], "config": {"trainable": true, "name": "global_max_pooling1d_8"}}, {"name": "concatenate_1", "class_name": "Concatenate", "inbound_nodes": [[["global_max_pooling1d_1", 0, 0, {}], ["global_max_pooling1d_2", 0, 0, {}], ["global_max_pooling1d_3", 0, 0, {}], ["global_max_pooling1d_4", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_1", "axis": -1}}, {"name": "concatenate_2", "class_name": "Concatenate", "inbound_nodes": [[["global_max_pooling1d_5", 0, 0, {}], ["global_max_pooling1d_6", 0, 0, {}], ["global_max_pooling1d_7", 0, 0, {}], ["global_max_pooling1d_8", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_2", "axis": -1}}, {"name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["concatenate_1", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_1", "rate": 0.1, "seed": null}}, {"name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["concatenate_2", 0, 0, {}]]], "config": {"trainable": true, "noise_shape": null, "name": "dropout_2", "rate": 0.1, "seed": null}}, {"name": "concatenate_3", "class_name": "Concatenate", "inbound_nodes": [[["dropout_1", 0, 0, {}], ["dropout_2", 0, 0, {}]]], "config": {"trainable": true, "name": "concatenate_3", "axis": -1}}, {"name": "repeat_vector_1", "class_name": "RepeatVector", "inbound_nodes": [[["concatenate_3", 0, 0, {}]]], "config": {"trainable": true, "name": "repeat_vector_1", "n": 128}}, {"name": "AttentionDecoder", "class_name": "AttentionDecoder", "inbound_nodes": [[["repeat_vector_1", 0, 0, {}]]], "config": {"implementation": 0, "return_sequences": true, "unroll": false, "stateful": false, "trainable": true, "go_backwards": false, "return_state": false, "name": "AttentionDecoder", "return_probabilities": false, "output_dim": 128, "units": 128}}, {"name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["AttentionDecoder", 0, 0, {}]]], "config": {"bias_initializer": {"class_name": "Zeros", "config": {}}, "activity_regularizer": null, "kernel_constraint": null, "name": "dense_1", "kernel_regularizer": null, "bias_regularizer": null, "bias_constraint": null, "units": 5001, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "normal", "mode": "fan_in"}}, "activation": "softmax", "use_bias": true}}], "name": "model_1", "input_layers": [["input_1", 0, 0], ["input_2", 0, 0]]}}