{"class_name": "Model", "backend": "tensorflow", "keras_version": "2.1.6", "config": {"name": "model_1", "output_layers": [["decoder_dense", 0, 0]], "layers": [{"name": "encoder_inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 300], "sparse": false, "name": "encoder_inputs"}, "inbound_nodes": []}, {"name": "decoder_inputs", "class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, null, 3001], "sparse": false, "name": "decoder_inputs"}, "inbound_nodes": []}, {"name": "encoder_lstm", "class_name": "LSTM", "config": {"name": "encoder_lstm", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "implementation": 1, "use_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "trainable": true, "kernel_constraint": null, "unroll": false, "return_sequences": true, "go_backwards": false, "return_state": true, "activity_regularizer": null, "units": 1024, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "unit_forget_bias": true, "stateful": false}, "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"name": "decoder_lstm", "class_name": "LSTM", "config": {"name": "decoder_lstm", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "activation": "tanh", "recurrent_constraint": null, "implementation": 1, "use_bias": true, "recurrent_regularizer": null, "recurrent_activation": "hard_sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "dropout": 0.2, "recurrent_dropout": 0.2, "trainable": true, "kernel_constraint": null, "unroll": false, "return_sequences": true, "go_backwards": false, "return_state": true, "activity_regularizer": null, "units": 1024, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "kernel_regularizer": null, "unit_forget_bias": true, "stateful": false}, "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm", 0, 1, {}], ["encoder_lstm", 0, 2, {}]]]}, {"name": "decoder_dense", "class_name": "Dense", "config": {"name": "decoder_dense", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}}, "bias_regularizer": null, "kernel_constraint": null, "activity_regularizer": null, "units": 3001, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_constraint": null, "trainable": true, "activation": "softmax"}, "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]]}}