{"config": {"name": "model_1", "layers": [{"name": "encoder_inputs", "config": {"name": "encoder_inputs", "batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "encoder_lstm", "config": {"units": 500, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": true, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "use_bias": true, "stateful": false, "name": "encoder_lstm", "unit_forget_bias": true, "return_sequences": true, "activation": "tanh", "dropout": 0.5, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "unroll": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "implementation": 1, "return_state": true}, "class_name": "LSTM", "inbound_nodes": [[["encoder_inputs", 0, 0, {}]]]}, {"name": "encoder_lstm2", "config": {"units": 500, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": true, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "use_bias": true, "stateful": false, "name": "encoder_lstm2", "unit_forget_bias": true, "return_sequences": true, "activation": "tanh", "dropout": 0.5, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "unroll": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "implementation": 1, "return_state": true}, "class_name": "LSTM", "inbound_nodes": [[["encoder_lstm", 0, 0, {}]]]}, {"name": "decoder_inputs", "config": {"name": "decoder_inputs", "batch_input_shape": [null, null, 300], "dtype": "float32", "sparse": false}, "class_name": "InputLayer", "inbound_nodes": []}, {"name": "encoder_lstm3", "config": {"units": 500, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": true, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "use_bias": true, "stateful": false, "name": "encoder_lstm3", "unit_forget_bias": true, "return_sequences": true, "activation": "tanh", "dropout": 0.5, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "unroll": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "implementation": 1, "return_state": true}, "class_name": "LSTM", "inbound_nodes": [[["encoder_lstm2", 0, 0, {}]]]}, {"name": "decoder_lstm", "config": {"units": 500, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "recurrent_regularizer": null, "go_backwards": false, "recurrent_activation": "hard_sigmoid", "bias_regularizer": null, "trainable": true, "use_bias": true, "stateful": false, "name": "decoder_lstm", "unit_forget_bias": true, "return_sequences": true, "activation": "tanh", "dropout": 0.5, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "unroll": false, "recurrent_constraint": null, "recurrent_dropout": 0.0, "kernel_constraint": null, "implementation": 1, "return_state": true}, "class_name": "LSTM", "inbound_nodes": [[["decoder_inputs", 0, 0, {}], ["encoder_lstm3", 0, 1, {}], ["encoder_lstm3", 0, 2, {}]]]}, {"name": "dropout_1", "config": {"name": "dropout_1", "trainable": true, "noise_shape": null, "rate": 0.5, "seed": null}, "class_name": "Dropout", "inbound_nodes": [[["decoder_lstm", 0, 0, {}]]]}, {"name": "decoder_dense", "config": {"trainable": true, "units": 1001, "activity_regularizer": null, "use_bias": true, "name": "decoder_dense", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "activation": "sigmoid", "bias_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "distribution": "uniform", "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_regularizer": null, "bias_regularizer": null, "kernel_constraint": null}, "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0, {}]]]}], "input_layers": [["encoder_inputs", 0, 0], ["decoder_inputs", 0, 0]], "output_layers": [["decoder_dense", 0, 0]]}, "backend": "tensorflow", "class_name": "Model", "keras_version": "2.1.6"}